** /Aside : Playing with literate code/

If you are reading this from the comfort of Emacs, you would be in an ~org-mode~
buffer. Any block of source code can be evaluated on your computer, provided you've
configured it. Assuming perhaps you haven't, but you /are/ in Emacs, move the cursor
to the source block below and press Control-C twice on your keyboard. Emacs will ask
If you want to run the code. Type ~yes~ to do so. It will enable you to run Ruby code
from within this file.

#+name: load-ruby-for-org-babel
#+begin_src emacs-lisp :results none
  (org-babel-do-load-languages
   'org-babel-load-languages
   '((emacs-lisp . t)
     (ruby . t)))
#+end_src

Now assuming that worked you should be able to do the same on the following block
of Ruby code. If you're just here to read, notice how printing the ~cord~ variable
is different than printing each knot of the cord individually:

#+begin_src ruby :results output :exports both
  cord = [1, 5, 0, 4]
  print(cord, "\n")
  cord.each { |knot| print(knot) }
#+end_src

#+RESULTS:
: [1, 5, 0, 4]
: 1504

I'm leaving the result of myself running it here in the document, if you run it
again it won't change. Try changing one of the knot numbers to see what happens
when you evaluate the code again.

